const settings = require('../settings');
const fs = require('fs');
const path = require('path');

async function helpCommand(sock, chatId, message) {
    const helpMessage = `
╔═══════════════════╗
   *🤖 ${settings.botName || '𝙳𝙰𝙽𝙳𝙾𝚁𝙰-𝙼𝙳'}*  
   Version: *${settings.version || '3.0.0'}*
   by ${settings.botOwner || 'NKOSI_DANDORA'}
   YT : ${global.ytch}
╚═══════════════════╝

*Available Commands:*

╭═✦〔 ✅ *ꜱᴇʟᴇᴄᴛᴇᴅ* ✅ 〕✦═╮
│🛠️ ᴘʀᴇғɪx  : [ ${settings.prefix} ]
│🚀 ᴠᴇʀsɪᴏɴ : *${settings.version}*
╰═══⭘════════════⚬═╯
 
╭═✦〔 🦠 *B͓̽U͓̽G͓̽ ͓̽M͓̽E͓̽N͓̽U͓̽* 〕✦═╮
│
│✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ OWNER: NKOSI_DANDORA 
│
│🍋 ⃝★    .crush-premium
│🍋 ⃝★    .kill-premium
│🍋 ⃝★    .218-premium
│🍋 ⃝★    .bug-group
│🍋 ⃝★    .bug-contact
│🍋 ⃝★    .bug-channel 
│🍋 ⃝★    .bug-allgc
│🍋 ⃝★    .`bug-allbotusers` 
│🍋 ⃝★    .`bug-phone` 
│🍋 ⃝★    .`crush-xd` 
│
│*To view and unlock more get exclusive permission to the owner* 😉*
╰═✪╾✦═✦═✦═✦═✦╼✪═╯

╔═══════════════════╗
♻️ *G͓̽e͓̽n͓̽e͓̽r͓̽a͓̽l͓̽ ͓̽C͓̽o͓̽m͓̽m͓̽a͓̽n͓̽d͓̽s͓̽:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚎𝚕𝚙 𝚘𝚛 .𝚖𝚎𝚗𝚞
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚒𝚗𝚐
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚊𝚕𝚒𝚟𝚎
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚝𝚜 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚘𝚠𝚗𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚓𝚘𝚔𝚎
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚚𝚞𝚘𝚝𝚎
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚏𝚊𝚌𝚝
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚠𝚎𝚊𝚝𝚑𝚎𝚛 <𝚌𝚒𝚝𝚢>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚗𝚎𝚠𝚜
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚊𝚝𝚝𝚙 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚕𝚢𝚛𝚒𝚌𝚜 <𝚜𝚘𝚗𝚐_𝚝𝚒𝚝𝚕𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝟾𝚋𝚊𝚕𝚕 <𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚐𝚛𝚘𝚞𝚙𝚒𝚗𝚏𝚘
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚝𝚊𝚏𝚏 𝚘𝚛 .𝚊𝚍𝚖𝚒𝚗𝚜 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚟𝚟
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚛𝚝 <𝚝𝚎𝚡𝚝> <𝚕𝚊𝚗𝚐>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚜 <𝚕𝚒𝚗𝚔>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚓𝚒𝚍
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚞𝚛𝚕
╚═══════════════════╝ 

╔═══════════════════╗
🎲 *POWER ADMIN COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤.𝚋𝚊𝚗 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚛𝚘𝚖𝚘𝚝𝚎 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚍𝚎𝚖𝚘𝚝𝚎 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚖𝚞𝚝𝚎 <𝚖𝚒𝚗𝚞𝚝𝚎𝚜>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚞𝚗𝚖𝚞𝚝𝚎
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚍𝚎𝚕𝚎𝚝𝚎 𝚘𝚛 .𝚍𝚎𝚕
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚔𝚒𝚌𝚔 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚠𝚊𝚛𝚗𝚒𝚗𝚐𝚜 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚠𝚊𝚛𝚗 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚊𝚗𝚝𝚒𝚕𝚒𝚗𝚔
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚊𝚗𝚝𝚒𝚋𝚊𝚍𝚠𝚘𝚛𝚍
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚕𝚎𝚊𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚊𝚐 <𝚖𝚎𝚜𝚜𝚊𝚐𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚊𝚐𝚊𝚕𝚕
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚊𝚐𝚗𝚘𝚝𝚊𝚍𝚖𝚒𝚗
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚒𝚍𝚎𝚝𝚊𝚐 <𝚖𝚎𝚜𝚜𝚊𝚐𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚑𝚊𝚝𝚋𝚘𝚝
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚛𝚎𝚜𝚎𝚝𝚕𝚒𝚗𝚔
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚊𝚗𝚝𝚒𝚝𝚊𝚐 <𝚘𝚗/𝚘𝚏𝚏>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚠𝚎𝚕𝚌𝚘𝚖𝚎 <𝚘𝚗/𝚘𝚏𝚏>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚐𝚘𝚘𝚍𝚋𝚢𝚎 <𝚘𝚗/𝚘𝚏𝚏>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚎𝚝𝚐𝚍𝚎𝚜𝚌 <𝚍𝚎𝚜𝚌𝚛𝚒𝚙𝚝𝚒𝚘𝚗>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚎𝚝𝚐𝚗𝚊𝚖𝚎 <𝚗𝚎𝚠 𝚗𝚊𝚖𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤   .𝚜𝚎𝚝𝚐𝚙𝚙 (𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎)
╚═══════════════════╝

╔═══════════════════╗
🔒 *CREATION OWNER COMMANDS*:
║
║ 🍋 ⃝★  .𝚖𝚘𝚍𝚎 <𝚙𝚞𝚋𝚕𝚒𝚌/𝚙𝚛𝚒𝚟𝚊𝚝𝚎>
║ 🍋 ⃝★  .𝚌𝚕𝚎𝚊𝚛𝚜𝚎𝚜𝚜𝚒𝚘𝚗
║ 🍋 ⃝★  .𝚊𝚗𝚝𝚒𝚍𝚎𝚕𝚎𝚝𝚎
║ 🍋 ⃝★  .𝚌𝚕𝚎𝚊𝚛𝚝𝚖𝚙
║ 🍋 ⃝★  .𝚞𝚙𝚍𝚊𝚝𝚎
║ 🍋 ⃝★  .𝚜𝚎𝚝𝚝𝚒𝚗𝚐𝚜
║ 🍋 ⃝★  .𝚜𝚎𝚝𝚙𝚙 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎>
║ 🍋 ⃝★  .𝚊𝚞𝚝𝚘𝚛𝚎𝚊𝚌𝚝 <𝚘𝚗/𝚘𝚏𝚏>
║ 🍋 ⃝★  .𝚊𝚞𝚝𝚘𝚜𝚝𝚊𝚝𝚞𝚜 <𝚘𝚗/𝚘𝚏𝚏>
║ 🍋 ⃝★  .𝚊𝚞𝚝𝚘𝚜𝚝𝚊𝚝𝚞𝚜 𝚛𝚎𝚊𝚌𝚝 <𝚘𝚗/𝚘𝚏𝚏>
║ 🍋 ⃝★  .𝚊𝚞𝚝𝚘𝚝𝚢𝚙𝚒𝚗𝚐 <𝚘𝚗/𝚘𝚏𝚏>
║ 🍋 ⃝★  .𝚊𝚞𝚝𝚘𝚛𝚎𝚊𝚍 <𝚘𝚗/𝚘𝚏𝚏>
║ 🍋 ⃝★  .𝚊𝚗𝚝𝚒𝚌𝚊𝚕𝚕 <𝚘𝚗/𝚘𝚏𝚏>
║ 🍋 ⃝★  .𝚙𝚖𝚋𝚕𝚘𝚌𝚔𝚎𝚛 <𝚘𝚗/𝚘𝚏𝚏/𝚜𝚝𝚊𝚝𝚞𝚜>
║ 🍋 ⃝★  .𝚙𝚖𝚋𝚕𝚘𝚌𝚔𝚎𝚛 𝚜𝚎𝚝𝚖𝚜𝚐 <𝚝𝚎𝚡𝚝>
║ 🍋 ⃝★  .𝚜𝚎𝚝𝚖𝚎𝚗𝚝𝚒𝚘𝚗 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚖𝚜𝚐>
║ 🍋 ⃝★  .𝚖𝚎𝚗𝚝𝚒𝚘𝚗 <𝚘𝚗/𝚘𝚏𝚏>
╚═══════════════════╝

╔═══════════════════╗
🎊   *STICKERS AND IMAGES COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚋𝚕𝚞𝚛 <𝚒𝚖𝚊𝚐𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚒𝚖𝚊𝚐𝚎 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚜𝚝𝚒𝚌𝚔𝚎𝚛>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚝𝚒𝚌𝚔𝚎𝚛 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚛𝚎𝚖𝚘𝚟𝚎𝚋𝚐
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚛𝚎𝚖𝚒𝚗𝚒
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚛𝚘𝚙 <𝚛𝚎𝚙𝚕𝚢 𝚝𝚘 𝚒𝚖𝚊𝚐𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚐𝚜𝚝𝚒𝚌𝚔𝚎𝚛 <𝙻𝚒𝚗𝚔>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚖𝚎𝚖𝚎
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚊𝚔𝚎 <𝚙𝚊𝚌𝚔𝚗𝚊𝚖𝚎> 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚎𝚖𝚘𝚓𝚒𝚖𝚒𝚡 <𝚎𝚖𝚓𝟷>+<𝚎𝚖𝚓𝟸>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚐𝚜 <𝚒𝚗𝚜𝚝𝚊 𝚕𝚒𝚗𝚔>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚐𝚜𝚌 <𝚒𝚗𝚜𝚝𝚊 𝚕𝚒𝚗𝚔>
╚═══════════════════╝  

╔═══════════════════╗
🖼️ *PIES COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚒𝚎𝚜 <𝚌𝚘𝚞𝚗𝚝𝚛𝚢>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚑𝚒𝚗𝚊 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚗𝚍𝚘𝚗𝚎𝚜𝚒𝚊 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚓𝚊𝚙𝚊𝚗 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚔𝚘𝚛𝚎𝚊 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚒𝚓𝚊𝚋
╚═══════════════════╝

╔═══════════════════╗
🎮 *DM AND RP GAME COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚒𝚌𝚝𝚊𝚌𝚝𝚘𝚎 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚊𝚗𝚐𝚖𝚊𝚗
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚐𝚞𝚎𝚜𝚜 <𝚕𝚎𝚝𝚝𝚎𝚛>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚛𝚒𝚟𝚒𝚊
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚊𝚗𝚜𝚠𝚎𝚛 <𝚊𝚗𝚜𝚠𝚎𝚛>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚛𝚞𝚝𝚑
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚍𝚊𝚛𝚎
╚═══════════════════╝

╔═══════════════════╗
👾 *AI COMMANDS*:
║ 🍋 ⃝★  .𝚐𝚙𝚝 <𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗>
║ 🍋 ⃝★  .𝚐𝚎𝚖𝚒𝚗𝚒 <𝚚𝚞𝚎𝚜𝚝𝚒𝚘𝚗>
║ 🍋 ⃝★  .𝚒𝚖𝚊𝚐𝚒𝚗𝚎 <𝚙𝚛𝚘𝚖𝚙𝚝>
║ 🍋 ⃝★  .𝚏𝚕𝚞𝚡 <𝚙𝚛𝚘𝚖𝚙𝚝>
║ 🍋 ⃝★ .𝚜𝚘𝚛𝚊 <𝚙𝚛𝚘𝚖𝚙𝚝>
║
🤖 *EXCLUSIVE AI COMMANDS*
║
║ ★ *DARK WEB*
║ ★ *OION WEB* 
║ ★ *F-SOCIETY* 
║ ★ *DANDORA-TECH* 
║ ★ *FREE WIFI* 
║ ★ *FAKE NUMBER* 
║ ★ *SOCIAL MEDIA ACC-HACK*
╚═══════════════════╝

╔═══════════════════╗
🤣 *ENJOYABLE FUN COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚘𝚖𝚙𝚕𝚒𝚖𝚎𝚗𝚝 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚗𝚜𝚞𝚕𝚝 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚏𝚕𝚒𝚛𝚝 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚑𝚊𝚢𝚊𝚛𝚒
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚐𝚘𝚘𝚍𝚗𝚒𝚐𝚑𝚝
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚛𝚘𝚜𝚎𝚍𝚊𝚢
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚑𝚊𝚛𝚊𝚌𝚝𝚎𝚛 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚠𝚊𝚜𝚝𝚎𝚍 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚑𝚒𝚙 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚒𝚖𝚙 @𝚞𝚜𝚎𝚛
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚝𝚞𝚙𝚒𝚍 @𝚞𝚜𝚎𝚛 [𝚝𝚎𝚡𝚝]
╚═══════════════════╝

╔═══════════════════╗
🔤 *TEXTMAKER COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚖𝚎𝚝𝚊𝚕𝚕𝚒𝚌 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚌𝚎 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚗𝚘𝚠 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚖𝚙𝚛𝚎𝚜𝚜𝚒𝚟𝚎 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚖𝚊𝚝𝚛𝚒𝚡 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚕𝚒𝚐𝚑𝚝 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚗𝚎𝚘𝚗 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚍𝚎𝚟𝚒𝚕 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚞𝚛𝚙𝚕𝚎 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚑𝚞𝚗𝚍𝚎𝚛 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚕𝚎𝚊𝚟𝚎𝚜 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝟷𝟿𝟷𝟽 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚊𝚛𝚎𝚗𝚊 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚊𝚌𝚔𝚎𝚛 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚊𝚗𝚍 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚋𝚕𝚊𝚌𝚔𝚙𝚒𝚗𝚔 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚐𝚕𝚒𝚝𝚌𝚑 <𝚝𝚎𝚡𝚝>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚏𝚒𝚛𝚎 <𝚝𝚎𝚡𝚝>
╚═══════════════════╝

╔═══════════════════╗
📥 *FREE DOWNLOADER*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚕𝚊𝚢 <𝚜𝚘𝚗𝚐_𝚗𝚊𝚖𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚘𝚗𝚐 <𝚜𝚘𝚗𝚐_𝚗𝚊𝚖𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚜𝚙𝚘𝚝𝚒𝚏𝚢 <𝚚𝚞𝚎𝚛𝚢>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚗𝚜𝚝𝚊𝚐𝚛𝚊𝚖 <𝚕𝚒𝚗𝚔>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚏𝚊𝚌𝚎𝚋𝚘𝚘𝚔 <𝚕𝚒𝚗𝚔>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚒𝚔𝚝𝚘𝚔 <𝚕𝚒𝚗𝚔>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚟𝚒𝚍𝚎𝚘 <𝚜𝚘𝚗𝚐 𝚗𝚊𝚖𝚎>
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚢𝚝𝚖𝚙𝟺 <𝙻𝚒𝚗𝚔>
╚═══════════════════╝

╔═══════════════════╗
🧩 *MISC COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚎𝚊𝚛𝚝
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚘𝚛𝚗𝚢
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚒𝚛𝚌𝚕𝚎
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚕𝚐𝚋𝚝
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚕𝚘𝚕𝚒𝚌𝚎
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚒𝚝𝚜-𝚜𝚘-𝚜𝚝𝚞𝚙𝚒𝚍
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚗𝚊𝚖𝚎𝚌𝚊𝚛𝚍 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚘𝚘𝚐𝚠𝚊𝚢
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚠𝚎𝚎𝚝
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚢𝚝𝚌𝚘𝚖𝚖𝚎𝚗𝚝 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚘𝚖𝚛𝚊𝚍𝚎 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚐𝚊𝚢 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚐𝚕𝚊𝚜𝚜 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚓𝚊𝚒𝚕 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚊𝚜𝚜𝚎𝚍 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚝𝚛𝚒𝚐𝚐𝚎𝚛𝚎𝚍
╚═══════════════════╝

╔═══════════════════╗
🥵 *ANIME COMMANDS*:
║
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚗𝚘𝚖 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚘𝚔𝚎 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚌𝚛𝚢 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚔𝚒𝚜𝚜 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚙𝚊𝚝 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚑𝚞𝚐 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚠𝚒𝚗𝚔 
║ ✤꯭ָ֟፝݊͞🌸꯭ָ֟፝݊͞✤ .𝚏𝚊𝚌𝚎𝚙𝚊𝚕𝚖 
╚═══════════════════╝

╔═══════════════════╗
💻 *INFO GITHUB COMMANDS:*
║ 🍋 ⃝★  .𝚐𝚒𝚝
║ 🍋 ⃝★  .𝚐𝚒𝚝𝚑𝚞𝚋
║ 🍋 ⃝★  .𝚜𝚌
║ 🍋 ⃝★  .𝚜𝚌𝚛𝚒𝚙𝚝
║ 🍋 ⃝★  .𝚛𝚎𝚙𝚘
╚═══════════════════╝

Join my channel for updates:`;

    try {
        const imagePath = path.join(__dirname, '../assets/bot_image.jpg');
        
        if (fs.existsSync(imagePath)) {
            const imageBuffer = fs.readFileSync(imagePath);
            
            await sock.sendMessage(chatId, {
                image: imageBuffer,
                caption: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363429495088710@newsletter',
                        newsletterName: '𝙳𝙰𝙽𝙳𝙾𝚁𝙰-𝚃𝙴𝙲𝙷',
                        serverMessageId: -1
                    }
                }
            },{ quoted: message });
        } else {
            console.error('Bot image not found at:', imagePath);
            await sock.sendMessage(chatId, { 
                text: helpMessage,
                contextInfo: {
                    forwardingScore: 1,
                    isForwarded: true,
                    forwardedNewsletterMessageInfo: {
                        newsletterJid: '120363429495088710@newsletter',
                        newsletterName: '𝙳𝙰𝙽𝙳𝙾𝚁𝙰-𝙼𝙳 by NKOSI_DANDORA',
                        serverMessageId: -1
                    } 
                }
            });
        }
    } catch (error) {
        console.error('Error in help command:', error);
        await sock.sendMessage(chatId, { text: helpMessage });
    }
}

module.exports = helpCommand;